Revit 2024 API
ReferenceableViewUtils.GetReferencedViewId Method
 Gets the id of the view referenced by a reference view (such as a reference section or reference callout).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static ElementId GetReferencedViewId(
	Document document,
	ElementId referenceId
)
Visual Basic
Public Shared Function GetReferencedViewId ( _
	document As Document, _
	referenceId As ElementId _
) As ElementId
Visual C++
public:
static ElementId^ GetReferencedViewId(
	Document^ document,
	ElementId^ referenceId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document containing the elements.
referenceId
Type: Autodesk.Revit.DB.ElementId
 The reference view that will be changed to refer to a different View.
Return Value
 The id of the referenced view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  referenceId is not a valid reference view.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ReferenceableViewUtils Class
Autodesk.Revit.DB Namespace